import { Metadata } from 'next'
import Link from 'next/link'

export const metadata: Metadata = {
	title: 'Договір оферти | M in M',
	icons: {
		icon: '/favicon.svg',
	},
	description: 'Публічний договір оферти інтернет-магазину M in M Nails',
	openGraph: {
		title: 'Договір оферти | M in M',
		description: 'Офіційні умови покупки товарів у нашому інтернет-магазині',
	},
	alternates: {
		canonical: '/offer-agreement',
	},
}

export default function OfferAgreement() {
	const link = (
		<Link
			href='https://m-in-m.com.ua'
			className='text-accent hover:text-accent-text active:text-accent-text duration-200'
		>
			https://m-in-m.com.ua
		</Link>
	)
	return (
		<section className='container'>
			<h1 className='text-3xl font-bold mb-6'>Договір оферти</h1>
			<div className='space-y-4'>
				<h3 className='font-semibold'>Умови використання сайту</h3>
				<h3 className='font-semibold'>1. Загальні положення</h3>
				<h3>
					1.1. Ця Угода визначає умови використання Користувачами (Покупцями)
					матеріалів і сервісів сайту {link} (далі — Сайт, веб-сайт,
					інтернет-магазин)
				</h3>
				<h3>
					1.2. Ця угода відповідно до ст.633, ст. 641 і розд. 63 Цивільного
					кодексу України є публічним договором (офертою) і адресована
					невизначеному колу осіб не залежно від статусу (фізична особа,
					юридична особа, фізична особа-підприємець), які бажають придбати
					товари в інтернет-магазині {link} <br /> Продавцями товару можуть бути
					інші треті особи (не Адміністрація), які користуються послугами {link}{' '}
					для реалізації своїх товарів в мережі Інтернет. Інформація про таких
					продавців надається Адміністрацією за запитом Користувача (Покупця).
				</h3>
				<h3>
					1.3. Оскільки ця Угода є публічною офертою, то отримуючи доступ до
					матеріалів Сайту, Користувач (Покупець) вважається учасником цієї
					Угоди.
				</h3>
				<h3>
					1.4. Адміністрація Сайту (власник сайту {link} і / або уповноважені
					ним особи) має право в будь-який час за одностороннім порядом
					змінювати умови цієї Угоди. Нова або змінена Угода стають дійсними
					після розміщення її на Сайті. За незгоди Користувача з внесеними
					змінами він зобов'язаний відмовитися від доступу до Сайту, припинити
					використання матеріалів і сервісів Сайту.
				</h3>
				<h3>
					1.5.Покупець погоджується з цією публічною офертою загалом і без
					застережень під час оформлення Замовлення на Сайті.
				</h3>
				<h3>
					1.6. Відвідувач (Покупець) погоджується з тим, що всі умови Угоди
					Користувача йому зрозумілі та він приймає їх повністю і беззастережно.
				</h3>
				<h3 className='font-semibold'>2. Реєстрація на Сайті</h3>
				<h3>
					2.1. Для формування замовлень на Сайті Користувач (Покупець) може
					пройти процедуру реєстрації та зазначити необхідні дані, згідно з
					анкетою.
				</h3>
				<h3>
					2.2. Під час реєстрації на Сайті Користувач (Покупець) зобов'язується
					надати достовірну інформацію про себе і свої контактні дані для
					виконання Адміністрацією Сайту своїх зобов'язань перед Користувачем
					(Покупцем) і доставки йому сплаченого Товару.
				</h3>
				<h3>
					2.3. У процесі реєстрації на Сайті Користувач (Покупець) вказує логін
					(його e-mail) і пароль, за безпеку яких він несе відповідальність.
					Користувач (Покупець) зобов'язується не повідомляти третім особам
					логін і пароль, вказані під час реєстрації, зберігати ці дані в
					недоступному для сторонніх осіб місці. За всі дії, що здійснені від
					його імені, тобто з використанням його логіна та пароля,
					відповідальність несе винятково Покупець.
				</h3>

				<h3 className='font-semibold'>
					Порядок оформлення Замовлень, ціноутворення, обмін.
				</h3>
				<h3>
					3.1. Відвідувач (Покупець) може оформити замовлення самостійно, шляхом
					натискання кнопки «купити» і «оформити замовлення» або за номером,
					вказаним у верхній частині сторінки. Після оформлення замовлення
					покупцеві буде направлено повідомлення щодо підтвердження замовлення
					на зазначені під час оформлення замовлення контакти та наявності
					товару або про передбачувану дату надходження товару в разі його
					відсутності. Під час оформлення замовлення телефоном повідомлення буде
					здійснене з допомогою телефонного зв'язку.
				</h3>
				<h3>
					3.2. У разі відсутності товару, вказаного на Сайті, внаслідок
					технічних негараздів, а також з інших причин, не залежних від
					Адміністрації, зазначене замовлення анулюється повністю або частково,
					а Відвідувач (Покупець) інформується шляхом надсилання йому
					повідомлення.
				</h3>
				<h3>
					3.3. Приєднуючись до цієї Угоди і оформлюючи замовлення, Користувач
					(Покупець) підтверджує, що ознайомлений із розділами Сайту «Доставка й
					оплата», «Про нас», погоджується з ними і розуміє їх повною мірою.
					Адміністрація залишає за собою право змінити термін доставки
					замовлення з відповідним попередженням користувача.
				</h3>
				<h3>
					3.4. Відвідувач (Покупець) погоджується з тим, що ціна на товар,
					відкладений ними до «кошика», його асортимент і кількість, будуть
					актуальними лише на момент формування «кошика» і можуть змінюватися,
					якщо покупка не була остаточно оформлена шляхом натискання кнопки
					«оформити замовлення», «купити».
				</h3>
				<h3>
					3.5. Відвідувач (Покупець) погоджується з тим, що придбаний ним Товар
					не підлягає обміну та поверненню в наступних випадках:
				</h3>
				<h3>
					3.5.1. Із моменту покупки Товару пройшло більше 14 календарних днів;
				</h3>
				<div>
					<h3>
						3.5.2. Із моменту придбання Товару не минуло 14 календарних днів,
						але товар був у вжитку, порушена цілісність упаковки і / або
						комплектність, відсутні бирки / цінники і т.д.
					</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>
								Товар належить до переліку товарів, які поверненню та обміну не
								підлягають, відповідно до Постанови Кабінету Міністрів України
								№172 від 19 березня 1994 року (за чинної редакції)
								http://zakon4.rada.gov.ua, а саме:
							</h3>
							<h3>
								Продовольчі товари, лікарські препарати та засоби, предмети
								сангігієни.
							</h3>
							<h3>Непродовольчі товари:</h3>
							<ul className='list-disc list-inside'>
								<li>
									<h3 className='inline'>парфюмерно-косметичні вироби;</h3>
								</li>
								<li>
									<h3 className='inline'>
										розчіски, гребенці та щітки масажні;
									</h3>
								</li>
								<li>
									<h3 className='inline'>рукавички;</h3>
								</li>
								<li>
									<h3 className='inline'>товари в аерозольній упаковці;</h3>
								</li>
								<li>
									<h3 className='inline'>
										інструменти для манікюру, педикюру (ножиці, пилочки тощо).
									</h3>
								</li>
							</ul>
						</li>
					</ul>
				</div>
				<h3>
					3.5.3. Відвідувач (Покупець) відмовляється надати фото- чи
					відеоматеріали бракованого і / або несправного, на його погляд,
					товару.
				</h3>
				<h3>
					3.6. Цією Угодою Користувач (Покупець) підтверджує свою обізнаність у
					тому, що обміну або поверненню підлягає тільки новий товар, який не
					був у вжитку та не має слідів використання: подряпин, сколів; мають
					бути збережені: повний комплект товару, цілісність і всі компоненти
					упаковки, ярлики, маркування та Відвідувач (Покупець) має оригінал
					документа, що підтверджує факт покупки відповідного Товару. Порушення
					будь-якого з цих пунктів залишає за Адміністрацією право відмовити
					Відвідувачеві (Покупцеві) в обміні або поверненні товару.
				</h3>
				<h3>
					3.7. Під час замовлення товару на сайті Користувач (Покупець)
					підтверджує свою згоду отримувати інформацію про дату виробництва,
					терміни зберігання продукції в форматі, передбаченим
					брендом-виробником, нанесеного на упаковку продукту або інших
					маркувань виробника.
				</h3>
				<h3>
					3.8. При замовленні товару на сайті Користувач (Покупець) підтверджує
					згоду на об'єднання оформлених на одного одержувача замовлень в одній
					упаковці і отримання однією посилкою. У разі об'єднання замовлень
					Користувач (Покупець) буде повідомлений за допомогою повідомлення на
					вказану при оформленні електронну пошту.
				</h3>
				<h3>
					3.9 За відмови Відвідувача (Покупця) від товару Адміністрація повертає
					йому суму, сплачену Покупцем, за винятком витрат Продавця на доставку
					від Покупця повернутого товару.
				</h3>

				<h3 className='font-semibold'>4. Відповідальність сторін</h3>
				<h3>
					4.1. Адміністрація не несе жодної відповідальності за будь-які
					помилки, друкарські огріхи та неточності, які можуть бути виявлені в
					матеріалах, що містяться на цьому веб-сайті. Адміністрація докладає
					всіх необхідних зусиль, щоб забезпечити точність і достовірність на
					сайті Інтернет-магазину інформації. Вся інформація та матеріали
					надаються на умовах "як є", без будь-яких гарантій, як явних, так і
					непрямих.
				</h3>
				<h3>
					4.2. Адміністрація не несе жодної відповідальності за висловлювання і
					думки Відвідувачів (Покупця) веб-сайту, залишені в якості коментарів
					або оглядів.
				</h3>
				<h3>
					4.3. Адміністрація не несе відповідальність за можливі протиправні дії
					Відвідувача (Покупця) щодо третіх осіб або дії третіх осіб щодо
					Відвідувача / Покупця.
				</h3>
				<h3>
					4.4. Адміністрація не несе відповідальності за шкоду, збитки або
					витрати (реальні або можливі), що виникли в зв'язку з цим веб-сайтом,
					його використанням або неможливістю використання.
				</h3>
				<h3>
					4.5. Адміністрація не несе відповідальності за втрату Користувачем
					(Покупцем) можливості доступу до свого облікового запису — облікового
					запису на сайті {link} (втрату логіна, пароля, іншої інформації).
				</h3>
				<h3>
					4.6. З метою вищезазначеного Адміністрація залишає за собою право
					видаляти розміщену на Сайті інформацію та робити технічні і юридичні
					заходи для припинення доступу до Інтернет-магазину користувачів
					(Покупців), що створюють проблеми у використанні Інтернет-магазину
					іншими Відвідувачами (Покупцями), Користувачів (Покупців) у разі
					будь-яких недобросовісних зловживань з їх боку при замовленні товару,
					що не мають на меті його придбання, або Відвідувачів (Покупців), які
					порушують вимоги Угоди. При цьому таке блокування відбувається на
					розсуд адміністрації без наступного повідомлення таких Користувачів
					(Покупців).
				</h3>
				<h3>4.7. Адміністрація веб-сайту не несе відповідальності за:</h3>
				<h3>
					4.7.1. Затримки або збої в процесі здійснення операції, що виникли
					внаслідок непереборної сили, а також будь-якого випадку негараздів у
					телекомунікаційних, комп'ютерних, електричних та інших суміжних
					системах.
				</h3>
				<h3>
					4.7.2. Дії систем переказів, банків, платіжних систем і за затримки,
					пов'язані з їх роботою.
				</h3>
				<h3>
					4.7.3. Належне функціонування Сайту, якщо Відвідувач (Покупець) не має
					необхідних технічних засобів для його використання, а також не несе
					жодних зобов'язань щодо забезпечення користувачів такими засобами.
				</h3>
				<h3>
					4.8. Сторони несуть відповідальність за виконання своїх зобов'язань
					відповідно до чинного законодавства України і положень цього Договору.
				</h3>
				<h3>
					4.9. Продавець або Покупець звільняються від відповідальності за повне
					або часткове невиконання своїх зобов'язань, якщо невиконання є
					наслідком форс-мажорних обставин як: війна або військові дії,
					землетрус, повінь, пожежа та інші стихійні лиха, що виникли незалежно
					від волі Продавця та/або Покупця після укладення цього договору.
					Сторона, яка не може виконати свої зобов'язання, негайно повідомляє
					про це іншу Сторону.
				</h3>

				<h3 className='font-semibold'>5. Виняткові права</h3>
				<h3>
					5.1. Всі об'єкти, доступні з допомогою сервісів Сайту {link}, зокрема елементи дизайну, текст, графічні зображення,
					ілюстрації, відео, програми для ЕОМ, бази даних, музика, звуки та інші
					об'єкти (далі — зміст сервісів), а також будь-який контент, розміщений
					на веб-сайті {link} є об'єктами виняткових прав Адміністрації,
					користувачів та інших правовласників.
				</h3>
				<h3>
					5.2. Використання контенту, а також будь-яких інших елементів сервісів
					можливо тільки в рамках функціоналу, пропонованого тим чи тим
					сервісом. Жодні елементи змісту сервісів Сайту {link} а також будь-який
					контент, розміщений на сервісах Сайту {link} не можуть бути використані іншим чином без попереднього
					дозволу/згоди правовласника. Під використанням йдеться про
					відтворення, копіювання, переробку, поширення на будь-якій основі,
					відображення у розіграші тощо. Виняток становлять випадки,
					безпосередньо передбачені законодавством України. Використання
					Користувачем елементів змісту сервісів, а також будь-якого контенту
					для особистого некомерційного використання, допускається за умови
					збереження всіх знаків охорони авторського права, суміжних прав,
					товарних знаків, інших повідомлень про авторство, збереження імені
					(або псевдоніма) автора/найменування правовласника в незмінному
					вигляді, збереженні відповідного об'єкта в незмінному вигляді. Виняток
					становлять випадки, прямо передбачені законодавством України.
				</h3>
				<h3>
					5.3. З усіх питань щодо прав, а також з іншими питаннями та
					пропозиціями Ви можете зв'язатися з нами за електронною адресою:
					m.in.m.nails@gmail.com
				</h3>

				<h3>
					6. Web - сайт {link} належить на праві власності ФОП Попов Михайло
					Михайлович
				</h3>
				<h3>
					Всі фрази об'єкти права інтелектуальної власності, які містяться на
					сайті, окрім випадків, коли про це окремо зазначено, належать на праві
					власності Компанії.
				</h3>
			</div>
		</section>
	)
}
