import { Metadata } from 'next'
import Link from 'next/link'

export const metadata: Metadata = {
	title: 'Політика конфіденційності | M in M',
	icons: {
		icon: '/favicon.svg',
	},
	description:
		'Як ми збираємо, використовуємо та захищаємо ваші персональні дані',
	openGraph: {
		title: 'Політика конфіденційності | M in M',
		description: 'Захист персональних даних у інтернет-магазині M in M',
	},
	alternates: {
		canonical: '/privacy-policy',
	},
}

export default function PrivacyPolicy() {
	return (
		<section className='container'>
			<h1 className='text-3xl font-bold mb-6'>Політика конфіденційності</h1>
			<div className='space-y-4'>
				<h3>
					Дана угода про конфіденційність розроблена відповідно до вимог Закону
					України «Про захист персональних даних» та інших нормативних актів
					українського законодавства, що регламентують правові відносини,
					пов’язані зі збором, обробкою, зберіганням персональних даних, а також
					правом громадян на невтручання в особисте життя та правом на
					самовираження.
				</h3>
				<h3>
					Інтернет-магазин M in M, піклуючись про розвиток взаємовідносин з
					клієнтами, розуміючи важливість захисту Ваших персональних даних, з
					метою вирішення можливих протиріч і непорозумінь, підготував цю Угоду
					про конфіденційність (Політику конфіденційності), і умови користування
					веб-сайтом інтернет-магазину{' '}
					<Link
						href='https://m-in-m.com.ua'
						className='text-accent hover:text-accent-text active:text-accent-text duration-200'
					>
						https://m-in-m.com.ua
					</Link>{' '}
					(далі — «Сайт»).
				</h3>
				<h3>
					Будь ласка, уважно прочитайте дану сторінку, оскільки інформація,
					викладена на ній, є важливою для Вас як для Користувача сайту.
				</h3>

				<h3 className='font-semibold'>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</h3>
				<h3>
					1.1. У даній Політиці конфіденційності використовуються такі терміни:
				</h3>
				<h3>
					1.1.1. «Адміністрація сайту інтернет-магазину (далі — Адміністрація
					сайту)» — уповноважені співробітники інтернет-магазину M in M, які
					організовують обробку персональних даних, визначають цілі обробки,
					склад персональних даних, а також дії або операції, що здійснюються з
					ними.
				</h3>
				<h3>
					1.1.2. «Персональні дані» — будь-яка інформація, що прямо або
					опосередковано стосується певної фізичної особи.
				</h3>
				<h3>
					1.1.3. «Обробка персональних даних» — будь-яка дія (операція) або
					сукупність дій з використанням засобів автоматизації або без них:
					збір, запис, систематизація, накопичення, зберігання, уточнення
					(оновлення, зміна), витяг, використання, передача, знеособлення,
					блокування, видалення чи знищення персональних даних.
				</h3>
				<h3>
					1.1.4. «Конфіденційність персональних даних» — обов’язкова вимога,
					якої повинні дотримуватися Адміністрація сайту та інші особи, які
					отримали доступ до персональних даних, щоб уникнути їхнього
					розповсюдження без згоди суб’єкта або наявності законних підстав.
				</h3>
				<h3>
					1.1.5. «Користувач сайту інтернет-магазину M in M» — особа, яка має
					доступ до сайту за допомогою мережі Інтернет і використовує його
					функціонал.
				</h3>
				<h3>
					1.1.6. «Cookies» — невеликий фрагмент даних, який зберігається у
					браузері користувача та використовується для ідентифікації й
					збереження налаштувань.
				</h3>
				<h3>
					1.1.7. «IP-адреса» — унікальна мережева адреса вузла в комп’ютерній
					мережі за протоколом IP.
				</h3>
				<h3 className='font-semibold'>2. ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h3>
				<h3>
					2.1. Використовуючи сайт або оформлюючи замовлення, користувач
					підтверджує, що дає згоду інтернет-магазину M in M та уповноваженим
					ним особам на обробку персональних даних, а також що є повнолітньою
					особою.
				</h3>
				<div className='space-y-2'>
					<h3>
						2.2. Користувач надає згоду на збір, систематизацію, зберігання,
						уточнення (оновлення), використання, поширення, знеособлення,
						блокування, знищення своїх персональних даних для:
					</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>формування бази клієнтів;</h3>
						</li>
						<li>
							<h3 className='inline'>складання статистичних звітів;</h3>
						</li>
						<li>
							<h3 className='inline'>проведення маркетингових досліджень;</h3>
						</li>
						<li>
							<h3 className='inline'>
								взаємодії з користувачем, включаючи електронну пошту, SMS та
								інші засоби комунікації.
							</h3>
						</li>
					</ul>
				</div>
				<h3>
					2.3. Користувач підтверджує згоду з тим, що Адміністрація сайту має
					право здійснювати прямі контакти з ним засобами електрозв’язку.
				</h3>
				<h3 className='font-semibold'>3. МЕТА ЗБОРУ ТА ОБРОБКИ ДАНИХ</h3>
				<div className='space-y-2'>
					<h3>3.1. Персональна інформація використовується для:</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>
								ідентифікації користувача при реєстрації та авторизації;
							</h3>
						</li>
						<li>
							<h3 className='inline'>обробки замовлень і доставки товарів;</h3>
						</li>
						<li>
							<h3 className='inline'>
								надання доступу до кошика, обраних товарів і особистого
								кабінету;
							</h3>
						</li>
						<li>
							<h3 className='inline'>комунікації з користувачем;</h3>
						</li>
						<li>
							<h3 className='inline'>
								надсилання акційних пропозицій та інформації (за згодою
								користувача);
							</h3>
						</li>
						<li>
							<h3 className='inline'>
								покращення роботи сайту, аналітики та персоналізації сервісів.
							</h3>
						</li>
					</ul>
				</div>
				<h3 className='font-semibold'>4. КАТЕГОРІЇ ЗІБРАНИХ ДАНИХ</h3>
				<div className='space-y-2'>
					<h3>4.1. До персональних даних, що збираються, належать:</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>ПІБ користувача;</h3>
						</li>
						<li>
							<h3 className='inline'>контактний телефон;</h3>
						</li>
						<li>
							<h3 className='inline'>адреса електронної пошти;</h3>
						</li>
						<li>
							<h3 className='inline'>адреса доставки;</h3>
						</li>
						<li>
							<h3 className='inline'>історія замовлень;</h3>
						</li>
						<li>
							<h3 className='inline'>
								технічні дані: cookies, IP-адреса, дані браузера;
							</h3>
						</li>
						<li>
							<h3 className='inline'>
								інформація про дії на сайті (вибрані товари, кошик).
							</h3>
						</li>
					</ul>
				</div>
				<h3>
					4.2. Персональні дані надаються користувачем самостійно при реєстрації
					або автоматично збираються сайтом.
				</h3>
				<h3 className='font-semibold'>5. СПОСОБИ І ТЕРМІНИ ОБРОБКИ</h3>
				<h3>
					5.1. Обробка здійснюється без обмеження строку, у законний спосіб, з
					використанням засобів автоматизації та без них.
				</h3>
				<div className='space-y-2'>
					<h3>5.2. Персональні дані можуть передаватися:</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>
								кур’єрським та поштовим службам (для доставки товару);
							</h3>
						</li>
						<li>
							<h3 className='inline'>
								платіжним сервісам (для проведення оплати);
							</h3>
						</li>
						<li>
							<h3 className='inline'>
								технічним партнерам (для підтримки функціонування сайту).
							</h3>
						</li>
					</ul>
				</div>
				<h3 className='font-semibold'>6. ПРАВА КОРИСТУВАЧА</h3>
				<div className='space-y-2'>
					<h3>Користувач має право:</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>
								дізнатися, чи обробляються його персональні дані;
							</h3>
						</li>
						<li>
							<h3 className='inline'>отримати доступ до своїх даних;</h3>
						</li>
						<li>
							<h3 className='inline'>вимагати виправлення чи видалення;</h3>
						</li>
						<li>
							<h3 className='inline'>відкликати згоду на обробку;</h3>
						</li>
						<li>
							<h3 className='inline'>
								подати скаргу до Уповноваженого з прав людини.
							</h3>
						</li>
					</ul>
				</div>
				<h3 className='font-semibold'>7. ПОЛІТИКА ЩОДО COOKIE</h3>
				<h3>
					7.1. Сайт використовує cookie для збереження налаштувань, кошика,
					обраних товарів та аналітики.
				</h3>
				<div className='space-y-2'>
					<h3>7.2. Cookie застосовуються для:</h3>
					<ul className='list-disc list-inside'>
						<li>
							<h3 className='inline'>зручності користування сайтом;</h3>
						</li>
						<li>
							<h3 className='inline'>аналізу відвідуваності та статистики;</h3>
						</li>
						<li>
							<h3 className='inline'>персоналізації контенту.</h3>
						</li>
					</ul>
				</div>
				<h3 className='font-semibold'>8. БЕЗПЕКА ПЕРСОНАЛЬНИХ ДАНИХ</h3>
				<h3>
					8.1. Інтернет-магазин M in M приймає необхідні організаційні та
					технічні заходи для захисту персональної інформації Користувача від
					неправомірного або випадкового доступу, знищення, перекручення,
					блокування, копіювання, поширення, а також від інших неправомірних дій
					третіх осіб.
				</h3>
				<h3>
					8.2. Дана Політика конфіденційності поширюється тільки на сайті
					Інтернет-магазину M in M. Якщо за посиланнями, розміщеними на сайті
					останнього, Користувач зайде на ресурси третіх осіб, Інтернет-магазин
					за його дії відповідальності не несе.
				</h3>
				<h3>
					8.3. Персональні дані Користувача можуть бути використані в юридичних
					цілях в суді або на етапах, що ведуть до можливого звернення до суду в
					зв'язку з тим, що сайт або послуги використовувалися неналежним чином.
				</h3>
				<h3>
					Користувач обізнаний про те, що адміністарції сайту може бути змушена
					повідомити персональні дані на вимогу органів державної влади.
				</h3>
				<h3 className='font-semibold'>9. ДОДАТКОВА ІНФОРМАЦІЯ</h3>
				<h3>
					9.1. У разі використання сервісів третіх сторін (оплата, доставка),
					правила конфіденційності цих сервісів регулюють обробку даних
					користувача.
				</h3>
				<h3>
					9.2. Адміністрація сайту може надати дані користувача за вимогою
					державних органів у передбачених законом випадках.
				</h3>
				<h3 className='font-semibold'>10. ДОДАТКОВІ УМОВИ</h3>
				<h3>
					10.1. Адміністрація має право вносити зміни до цієї Політики без згоди
					користувача.
				</h3>
				<h3>
					10.2. Нова редакція Політики набирає чинності з моменту публікації на
					Сайті.
				</h3>
				<h3>
					10.3. У разі незгоди з умовами Користувач повинен припинити
					користування сайтом та може вимагати видалення своїх даних.
				</h3>
			</div>
		</section>
	)
}
